changing ASCII diagrams to mermaid diagrams in docs
